
'''
求中间数

【问题描述】
　　在一个整数序列a1, a2, …, an中，如果存在某个数，大于它的整数数量等于小于它的整数数量，则称其为中间数。在一个序列中，可能存在多个下标不相同的中间数，这些中间数的值是相同的。
　　给定一个整数序列，请找出这个整数序列的中间数的值。
【输入形式】
　　输入的第一行包含了一个整数n，表示整数序列中数的个数。
　　第二行包含n个正整数，依次表示a1, a2, …, an。
【输出形式】
　　如果约定序列的中间数存在，则输出中间数的值，否则输出-1表示不存在中间数。
【样例输入】
　　6
　　2 6 5 6 3 5
【样例输出】
　　5
【样例说明】
　　比5小的数有2个，比5大的数也有2个。
【样例输入】
　　4
　　3 4 6 7
【样例输出】
　　-1
【样例说明】
　　在序列中的4个数都不满足中间数的定义。
【样例输入】
　　5
　　3 4 6 6 7
【样例输出】
　　-1
【样例说明】
在序列中的5个数都不满足中间数的定义。
'''

n = input()
m = input()
ls = m.split(' ')

# 转化为整型
ls = list(map(int, ls))
# ls = [ int(x) for x in ls ]

# 排序
ls.sort()

# 去掉中间数字
ls_01 = []
for i in ls:
    if i != ls[int(len(ls)/2)]:
        ls_01.append(i)

# 如果等于偶数，说明大于和小于是相等的
if len(ls_01) % 2 == 0:
    print(ls[int(len(ls)/2)])
else:
    print(-1)


