
'''
矩阵的乘法

【问题描述】
编写程序，完成3*４矩阵和4*３整数矩阵的乘法，输出结果矩阵。
【输入形式】
以先行后列顺序输入第一个矩阵，而后输入第二个矩阵。
【输出形式】
先行后列顺序输出结果矩阵，每个元素的显示宽度为8格，屏幕一行只显示矩阵的一行。
例如要计算如下两个矩阵
第一个矩阵    1 2 3 4
             5 6 7 8
             9 1 2 3
第二个矩阵    9 8 7
             6 5 4
             3 2 1
             1 2 3
输入与输出格式如下
【样例输入】
1 2 3 4 5 6 7 8 9 1 2 3 9 8 7 6 5 4 3 2 1 1 2 3
【样例输出】
      34      32      30
     110     100     90
      96       87      78
【样例说明】
【评分标准】
'''

import numpy as np

# 3*４矩阵和4*３

str = input()
# str = '1 2 3 4 5 6 7 8 9 1 2 3 9 8 7 6 5 4 3 2 1 1 2 3'
ls = str.split(' ')
ls_ = []
for i in range(len(ls)):
    ls_.append(int(ls[i]))

ls_01 = ls_[:12]
ls_02 = ls_[12:]

def muli(ls_01,ls_02):
    m1 = np.reshape(ls_01, (3,4))
    m2 = np.reshape(ls_02, (4,3))

    mul = np.dot(m1,m2)
    for i in range(3):
        for j in range(3):
            print("%8d" % mul.flatten()[i*3+j],end='')
        print()

muli(ls_01,ls_02)